app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE (user_id = '2')
---
  def index
    # The user can only see its own favorites
    if @current_user.id == @user_id
      @favorites = Favorite.where('user_id = ?', params[:user_id])

INSERT INTO "favorites" ("car_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["car_id", 8], ["user_id", 3], ["created_at", "2020-09-05 13:03:01.849766"], ["updated_at", "2020-09-05 13:03:01.849766"]]
---
  def create
    # The user can only create its own favorites
    if @current_user.id == @user_id
      @favorite = Favorite.create!(favorite_params)

UPDATE "favorites" SET "car_id" = $1, "updated_at" = $2 WHERE "favorites"."id" = $3  [["car_id", 5], ["updated_at", "2020-09-05 18:31:49.181320"], ["id", 2]]
---
  def update
    # The user can only update its own favorites
    if @current_user.id == @user_id
      @favorite.update(favorite_params)

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    # The user can only delete its own favorites
    if @current_user.id == @user_id
      @favorite.destroy

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_favorite
    @favorite = Favorite.find(params[:id])