app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if @current_user.admin
      @users = User.all

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.create!(user_params)